run/Tests/convAnalysis1D/coarse/constant/faMesh/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/faMesh";
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches  1( bottom );

boundary
{
    left
    {
        type                symmetryPlane;
        ownerPolyPatch      bottom;
        neighbourPolyPatch  left;
    }

    right
    {
        type                patch;
        ownerPolyPatch      bottom;
        neighbourPolyPatch  right;
    }

    frontAndBack
    {
        type                empty;
        ownerPolyPatch      bottom;
        neighbourPolyPatch  frontAndBack;
    }
}

// ************************************************************************** //
